Revit 2027 API
ViewSystemsAnalysisReport.SystemsAnalysisWorkflowFile Property
 The full path name of the original system analysis workflow file.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SystemsAnalysisWorkflowFile { get; }
Public ReadOnly Property SystemsAnalysisWorkflowFile As String
	Get
public:
property String^ SystemsAnalysisWorkflowFile {
	String^ get ();
}
member SystemsAnalysisWorkflowFile : string with get
Property Value
String
See Also
Reference
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace